package com.geopokrovskiy.okved_game_test.unit.utils;

public class TestUtils {

    public static final String OKVED_TEST_JSON = """
            [
            {
                "code": "Раздел A",
                "name": "Сельское, лесное хозяйство, охота, рыболовство и рыбоводство",
                "items": [
                {
                    "code": "01",
                    "name": "Растениеводство и животноводство, охота и предоставление соответствующих услуг в этих областях",
                    "items": [
                    {
                        "code": "01.1",
                        "name": "Выращивание однолетних культур",
                        "items": [
                        {
                            "code": "01.11",
                            "name": "Выращивание зерновых (кроме риса), зернобобовых культур и семян масличных культур",
                            "items": [
                            {
                                "code": "01.11.1",
                                "name": "Выращивание зерновых культур",
                                "items": [
                                {
                                    "code": "01.11.11",
                                    "name": "Выращивание пшеницы"
                                },
                                {
                                    "code": "01.11.12",
                                    "name": "Выращивание ячменя"
                                },
                                {
                                    "code": "01.11.13",
                                    "name": "Выращивание ржи"
                                },
                                {
                                    "code": "01.11.14",
                                    "name": "Выращивание кукурузы"
                                },
                                {
                                    "code": "01.11.15",
                                    "name": "Выращивание овса"
                                },
                                {
                                    "code": "01.11.16",
                                    "name": "Выращивание гречихи"
                                },
                                {
                                    "code": "01.11.19",
                                    "name": "Выращивание прочих зерновых культур"
                                }]
                            },
                            {
                                "code": "01.11.2",
                                "name": "Выращивание зернобобовых культур"
                            },
                            {
                                "code": "01.11.3",
                                "name": "Выращивание семян масличных культур",
                                "items": [
                                {
                                    "code": "01.11.31",
                                    "name": "Выращивание семян подсолнечника"
                                },
                                {
                                    "code": "01.11.32",
                                    "name": "Выращивание семян рапса"
                                },
                                {
                                    "code": "01.11.33",
                                    "name": "Выращивание семян соевых бобов"
                                },
                                {
                                    "code": "01.11.39",
                                    "name": "Выращивание семян прочих масличных культур"
                                }]
                            }]
                        },
                        {
                            "code": "01.12",
                            "name": "Выращивание риса"
                        },
                        {
                            "code": "01.13",
                            "name": "Выращивание овощей, бахчевых, корнеплодных и клубнеплодных культур, грибов и трюфелей",
                            "items": [
                            {
                                "code": "01.13.1",
                                "name": "Выращивание овощей",
                                "items": [
                                {
                                    "code": "01.13.11",
                                    "name": "Выращивание овощей открытого грунта"
                                },
                                {
                                    "code": "01.13.12",
                                    "name": "Выращивание овощей защищенного грунта"
                                }]
                            },
                            {
                                "code": "01.13.2",
                                "name": "Выращивание бахчевых культур"
                            },
                            {
                                "code": "01.13.3",
                                "name": "Выращивание столовых корнеплодных и клубнеплодных культур с высоким содержанием крахмала или инулина",
                                "items": [
                                {
                                    "code": "01.13.31",
                                    "name": "Выращивание картофеля"
                                },
                                {
                                    "code": "01.13.39",
                                    "name": "Выращивание прочих столовых корнеплодных и клубнеплодных культур с высоким содержанием крахмала или инулина"
                                }]
                            },
                            {
                                "code": "01.13.4",
                                "name": "Выращивание семян овощных культур, за исключением семян сахарной свеклы"
                            },
                            {
                                "code": "01.13.5",
                                "name": "Выращивание сахарной свеклы и семян сахарной свеклы",
                                "items": [
                                {
                                    "code": "01.13.51",
                                    "name": "Выращивание сахарной свеклы"
                                },
                                {
                                    "code": "01.13.52",
                                    "name": "Выращивание семян сахарной свеклы"
                                }]
                            },
                            {
                                "code": "01.13.6",
                                "name": "Выращивание грибов и трюфелей"
                            },
                            {
                                "code": "01.13.9",
                                "name": "Выращивание овощей, не включенных в другие группировки"
                            }]
                        },
                        {
                            "code": "01.14",
                            "name": "Выращивание сахарного тростника"
                        },
                        {
                            "code": "01.15",
                            "name": "Выращивание табака и махорки"
                        },
                        {
                            "code": "01.16",
                            "name": "Выращивание волокнистых прядильных культур",
                            "items": [
                            {
                                "code": "01.16.1",
                                "name": "Выращивание хлопчатника"
                            },
                            {
                                "code": "01.16.2",
                                "name": "Выращивание льна"
                            },
                            {
                                "code": "01.16.3",
                                "name": "Выращивание обыкновенной конопли"
                            },
                            {
                                "code": "01.16.9",
                                "name": "Выращивание прочих текстильных культур"
                            }]
                        },
                        {
                            "code": "01.19",
                            "name": "Выращивание прочих однолетних культур",
                            "items": [
                            {
                                "code": "01.19.1",
                                "name": "Выращивание однолетних кормовых культур"
                            },
                            {
                                "code": "01.19.2",
                                "name": "Цветоводство",
                                "items": [
                                {
                                    "code": "01.19.21",
                                    "name": "Выращивание цветов в открытом и защищенном грунте"
                                },
                                {
                                    "code": "01.19.22",
                                    "name": "Выращивание семян цветов"
                                }]
                            },
                            {
                                "code": "01.19.3",
                                "name": "Выращивание семян свеклы (кроме семян сахарной свеклы) и семян кормовых культур"
                            },
                            {
                                "code": "01.19.9",
                                "name": "Выращивание прочих однолетних культур, не включенных в другие группировки"
                            }]
                        }]
                    },
                    {
                        "code": "01.2",
                        "name": "Выращивание многолетних культур",
                        "items": [
                        {
                            "code": "01.21",
                            "name": "Выращивание винограда"
                        },
                        {
                            "code": "01.22",
                            "name": "Выращивание тропических и субтропических культур"
                        },
                        {
                            "code": "01.23",
                            "name": "Выращивание цитрусовых культур"
                        },
                        {
                            "code": "01.24",
                            "name": "Выращивание семечковых и косточковых культур"
                        },
                        {
                            "code": "01.25",
                            "name": "Выращивание прочих плодовых деревьев, кустарников и орехов",
                            "items": [
                            {
                                "code": "01.25.1",
                                "name": "Выращивание прочих плодовых и ягодных культур"
                            },
                            {
                                "code": "01.25.2",
                                "name": "Выращивание семян плодовых и ягодных культур"
                            },
                            {
                                "code": "01.25.3",
                                "name": "Выращивание орехоплодных культур"
                            }]
                        },
                        {
                            "code": "01.26",
                            "name": "Выращивание плодов масличных культур"
                        },
                        {
                            "code": "01.27",
                            "name": "Выращивание культур для производства напитков",
                            "items": [
                            {
                                "code": "01.27.1",
                                "name": "Выращивание чая"
                            },
                            {
                                "code": "01.27.9",
                                "name": "Выращивание прочих культур для производства напитков"
                            }]
                        },
                        {
                            "code": "01.28",
                            "name": "Выращивание специй, пряно-ароматических, эфиромасличных и лекарственных культур",
                            "items": [
                            {
                                "code": "01.28.1",
                                "name": "Выращивание пряностей"
                            },
                            {
                                "code": "01.28.2",
                                "name": "Выращивание хмеля"
                            },
                            {
                                "code": "01.28.3",
                                "name": "Выращивание растений, используемых в основном в парфюмерии, фармации или в качестве инсектицидов, фунгицидов и для аналогичных целей"
                            }]
                        },
                        {
                            "code": "01.29",
                            "name": "Выращивание прочих многолетних культур"
                        }]
                    },
                    {
                        "code": "01.3",
                        "name": "Выращивание рассады",
                        "items": [
                        {
                            "code": "01.30",
                            "name": "Выращивание рассады"
                        }]
                    },
                    {
                        "code": "01.4",
                        "name": "Животноводство",
                        "items": [
                        {
                            "code": "01.41",
                            "name": "Разведение молочного крупного рогатого скота, производство сырого молока",
                            "items": [
                            {
                                "code": "01.41.1",
                                "name": "Разведение молочного крупного рогатого скота",
                                "items": [
                                {
                                    "code": "01.41.11",
                                    "name": "Разведение молочного крупного рогатого скота, кроме племенного"
                                },
                                {
                                    "code": "01.41.12",
                                    "name": "Разведение племенного молочного крупного рогатого скота"
                                }]
                            },
                            {
                                "code": "01.41.2",
                                "name": "Производство сырого коровьего молока и сырого молока прочего крупного рогатого скота (буйволов, яков и др.)",
                                "items": [
                                {
                                    "code": "01.41.21",
                                    "name": "Производство сырого коровьего молока"
                                },
                                {
                                    "code": "01.41.29",
                                    "name": "Производство сырого молока прочего крупного рогатого скота (буйволов, яков и др.)"
                                }]
                            }]
                        },
                        {
                            "code": "01.42",
                            "name": "Разведение прочих пород крупного рогатого скота и буйволов, производство спермы",
                            "items": [
                            {
                                "code": "01.42.1",
                                "name": "Разведение мясного и прочего крупного рогатого скота, включая буйволов, яков и др.",
                                "items": [
                                {
                                    "code": "01.42.11",
                                    "name": "Разведение мясного и прочего крупного рогатого скота, включая буйволов, яков и др., на мясо"
                                },
                                {
                                    "code": "01.42.12",
                                    "name": "Разведение племенного мясного и прочего крупного рогатого скота, включая буйволов, яков и др."
                                }]
                            },
                            {
                                "code": "01.42.2",
                                "name": "Производство бычьей спермы, а также спермы буйволов, яков и др."
                            }]
                        },
                        {
                            "code": "01.43",
                            "name": "Разведение лошадей и прочих животных семейства лошадиных отряда непарнокопытных",
                            "items": [
                            {
                                "code": "01.43.1",
                                "name": "Разведение лошадей, ослов, мулов, лошаков"
                            },
                            {
                                "code": "01.43.2",
                                "name": "Производство сырого кобыльего молока"
                            },
                            {
                                "code": "01.43.3",
                                "name": "Производство спермы жеребцов и ослов"
                            }]
                        },
                        {
                            "code": "01.44",
                            "name": "Разведение верблюдов и прочих животных семейства верблюжьих"
                        },
                        {
                            "code": "01.45",
                            "name": "Разведение овец и коз",
                            "items": [
                            {
                                "code": "01.45.1",
                                "name": "Разведение овец и коз"
                            },
                            {
                                "code": "01.45.2",
                                "name": "Производство сырого овечьего и козьего молока"
                            },
                            {
                                "code": "01.45.3",
                                "name": "Производство сырой (немытой) шерсти и волоса козы"
                            },
                            {
                                "code": "01.45.4",
                                "name": "Разведение племенных овец и коз"
                            }]
                        },
                        {
                            "code": "01.46",
                            "name": "Разведение свиней",
                            "items": [
                            {
                                "code": "01.46.1",
                                "name": "Выращивание и разведение свиней",
                                "items": [
                                {
                                    "code": "01.46.11",
                                    "name": "Выращивание свиней на мясо"
                                },
                                {
                                    "code": "01.46.12",
                                    "name": "Разведение племенного поголовья свиней"
                                }]
                            },
                            {
                                "code": "01.46.2",
                                "name": "Производство спермы хряков"
                            }]
                        },
                        {
                            "code": "01.47",
                            "name": "Разведение сельскохозяйственной птицы",
                            "items": [
                            {
                                "code": "01.47.1",
                                "name": "Выращивание и разведение сельскохозяйственной птицы: кур, индеек, уток, гусей и цесарок",
                                "items": [
                                {
                                    "code": "01.47.11",
                                    "name": "Выращивание сельскохозяйственной птицы на мясо"
                                },
                                {
                                    "code": "01.47.12",
                                    "name": "Разведение племенной сельскохозяйственной птицы"
                                }]
                            },
                            {
                                "code": "01.47.2",
                                "name": "Производство яиц сельскохозяйственной птицы"
                            },
                            {
                                "code": "01.47.3",
                                "name": "Деятельность инкубаторов для птицеводства"
                            }]
                        },
                        {
                            "code": "01.49",
                            "name": "Разведение прочих животных",
                            "items": [
                            {
                                "code": "01.49.1",
                                "name": "Пчеловодство",
                                "items": [
                                {
                                    "code": "01.49.11",
                                    "name": "Пчеловодство медового направления"
                                },
                                {
                                    "code": "01.49.12",
                                    "name": "Пчеловодство опылительного направления"
                                },
                                {
                                    "code": "01.49.13",
                                    "name": "Пчеловодство разведенческого направления"
                                }]
                            },
                            {
                                "code": "01.49.2",
                                "name": "Разведение кроликов и прочих пушных зверей на фермах",
                                "items": [
                                {
                                    "code": "01.49.21",
                                    "name": "Разведение кроликов, производство тонкого волоса кроликов на фермах"
                                },
                                {
                                    "code": "01.49.22",
                                    "name": "Разведение прочих пушных зверей на фермах"
                                }]
                            },
                            {
                                "code": "01.49.3",
                                "name": "Разведение шелкопряда",
                                "items": [
                                {
                                    "code": "01.49.31",
                                    "name": "Производство грен шелкопряда"
                                },
                                {
                                    "code": "01.49.32",
                                    "name": "Производство коконов шелкопряда"
                                }]
                            },
                            {
                                "code": "01.49.4",
                                "name": "Разведение оленей",
                                "items": [
                                {
                                    "code": "01.49.41",
                                    "name": "Разведение домашних северных оленей"
                                },
                                {
                                    "code": "01.49.42",
                                    "name": "Разведение пятнистых оленей, ланей"
                                },
                                {
                                    "code": "01.49.43",
                                    "name": "Разведение благородных оленей (европейских, кавказских, маралов, изюбрей)"
                                },
                                {
                                    "code": "01.49.44",
                                    "name": "Производство пантов северных оленей, пятнистых оленей, благородных оленей (европейских, кавказских, маралов, изюбрей), ланей"
                                }]
                            },
                            {
                                "code": "01.49.5",
                                "name": "Разведение домашних животных"
                            },
                            {
                                "code": "01.49.6",
                                "name": "Разведение лабораторных животных"
                            },
                            {
                                "code": "01.49.7",
                                "name": "Разведение дождевых червей"
                            },
                            {
                                "code": "01.49.9",
                                "name": "Разведение прочих животных, не включенных в другие группировки"
                            }]
                        }]
                    },
                    {
                        "code": "01.5",
                        "name": "Смешанное сельское хозяйство",
                        "items": [
                        {
                            "code": "01.50",
                            "name": "Смешанное сельское хозяйство"
                        }]
                    },
                    {
                        "code": "01.6",
                        "name": "Деятельность вспомогательная в области производства сельскохозяйственных культур и послеуборочной обработки сельхозпродукции",
                        "items": [
                        {
                            "code": "01.61",
                            "name": "Предоставление услуг в области растениеводства"
                        },
                        {
                            "code": "01.62",
                            "name": "Предоставление услуг в области животноводства"
                        },
                        {
                            "code": "01.63",
                            "name": "Деятельность сельскохозяйственная после сбора урожая"
                        },
                        {
                            "code": "01.64",
                            "name": "Обработка семян для посадки"
                        }]
                    },
                    {
                        "code": "01.7",
                        "name": "Охота, отлов и отстрел диких животных, включая предоставление услуг в этих областях",
                        "items": [
                        {
                            "code": "01.70",
                            "name": "Охота, отлов и отстрел диких животных, включая предоставление услуг в этих областях"
                        }]
                    }]
                },
                {
                    "code": "02",
                    "name": "Лесоводство и лесозаготовки",
                    "items": [
                    {
                        "code": "02.1",
                        "name": "Лесоводство и прочая лесохозяйственная деятельность",
                        "items": [
                        {
                            "code": "02.10",
                            "name": "Лесоводство и прочая лесохозяйственная деятельность",
                            "items": [
                            {
                                "code": "02.10.1",
                                "name": "Деятельность лесопитомников",
                                "items": [
                                {
                                    "code": "02.10.11",
                                    "name": "Выращивание посадочного материала лесных растений (саженцев, сеянцев)"
                                },
                                {
                                    "code": "02.10.19",
                                    "name": "Выращивание прочей продукции лесопитомниками"
                                }]
                            },
                            {
                                "code": "02.10.2",
                                "name": "Деятельность лесохозяйственная прочая"
                            }]
                        }]
                    },
                    {
                        "code": "02.2",
                        "name": "Лесозаготовки",
                        "items": [
                        {
                            "code": "02.20",
                            "name": "Лесозаготовки"
                        }]
                    },
                    {
                        "code": "02.3",
                        "name": "Сбор и заготовка пищевых лесных ресурсов, недревесных лесных ресурсов и лекарственных растений",
                        "items": [
                        {
                            "code": "02.30",
                            "name": "Сбор и заготовка пищевых лесных ресурсов, недревесных лесных ресурсов и лекарственных растений",
                            "items": [
                            {
                                "code": "02.30.1",
                                "name": "Сбор и заготовка пищевых лесных ресурсов",
                                "items": [
                                {
                                    "code": "02.30.11",
                                    "name": "Сбор и заготовка дикорастущих грибов"
                                },
                                {
                                    "code": "02.30.12",
                                    "name": "Сбор и заготовка дикорастущих плодов, ягод"
                                },
                                {
                                    "code": "02.30.13",
                                    "name": "Сбор и заготовка дикорастущих орехов"
                                },
                                {
                                    "code": "02.30.14",
                                    "name": "Сбор лекарственных растений"
                                }]
                            },
                            {
                                "code": "02.30.2",
                                "name": "Сбор и заготовка недревесных лесных ресурсов"
                            }]
                        }]
                    },
                    {
                        "code": "02.4",
                        "name": "Предоставление услуг в области лесоводства и лесозаготовок",
                        "items": [
                        {
                            "code": "02.40",
                            "name": "Предоставление услуг в области лесоводства и лесозаготовок",
                            "items": [
                            {
                                "code": "02.40.1",
                                "name": "Предоставление услуг в области лесоводства"
                            },
                            {
                                "code": "02.40.2",
                                "name": "Предоставление услуг в области лесозаготовок"
                            }]
                        }]
                    }]
                },
                {
                    "code": "03",
                    "name": "Рыболовство и рыбоводство",
                    "items": [
                    {
                        "code": "03.1",
                        "name": "Рыболовство",
                        "items": [
                        {
                            "code": "03.11",
                            "name": "Рыболовство морское",
                            "items": [
                            {
                                "code": "03.11.1",
                                "name": "Рыболовство морское промышленное"
                            },
                            {
                                "code": "03.11.2",
                                "name": "Рыболовство морское прибрежное"
                            },
                            {
                                "code": "03.11.3",
                                "name": "Рыболовство в научно-исследовательских и контрольных целях"
                            },
                            {
                                "code": "03.11.4",
                                "name": "Рыболовство в учебных и культурно-просветительских целях"
                            },
                            {
                                "code": "03.11.5",
                                "name": "Рыболовство морское в целях аквакультуры (рыбоводства)"
                            }]
                        },
                        {
                            "code": "03.12",
                            "name": "Рыболовство пресноводное",
                            "items": [
                            {
                                "code": "03.12.1",
                                "name": "Рыболовство пресноводное промышленное"
                            },
                            {
                                "code": "03.12.2",
                                "name": "Рыболовство пресноводное в целях аквакультуры (рыбоводства)"
                            },
                            {
                                "code": "03.12.3",
                                "name": "Рыболовство любительское и спортивное"
                            },
                            {
                                "code": "03.12.4",
                                "name": "Рыболовство в целях обеспечения ведения традиционного образа жизни и осуществления традиционной хозяйственной деятельности коренных малочисленных народов Севера, Сибири и Дальнего Востока Российской Федерации"
                            }]
                        }]
                    },
                    {
                        "code": "03.2",
                        "name": "Рыбоводство",
                        "items": [
                        {
                            "code": "03.21",
                            "name": "Рыбоводство морское",
                            "items": [
                            {
                                "code": "03.21.1",
                                "name": "Рыбоводство морское индустриальное"
                            },
                            {
                                "code": "03.21.2",
                                "name": "Рыбоводство морское пастбищное"
                            },
                            {
                                "code": "03.21.3",
                                "name": "Мелиорация рыбохозяйственная морских и минерализированных водных объектов"
                            },
                            {
                                "code": "03.21.4",
                                "name": "Воспроизводство морских биоресурсов искусственное"
                            },
                            {
                                "code": "03.21.5",
                                "name": "Акклиматизация морских биоресурсов"
                            },
                            {
                                "code": "03.21.9",
                                "name": "Деятельность по морскому рыбоводству прочая"
                            }]
                        },
                        {
                            "code": "03.22",
                            "name": "Рыбоводство пресноводное",
                            "items": [
                            {
                                "code": "03.22.1",
                                "name": "Рыбоводство пресноводное индустриальное"
                            },
                            {
                                "code": "03.22.2",
                                "name": "Рыбоводство пресноводное пастбищное"
                            },
                            {
                                "code": "03.22.3",
                                "name": "Рыбоводство прудовое"
                            },
                            {
                                "code": "03.22.4",
                                "name": "Мелиорация рыбохозяйственная пресноводных объектов"
                            },
                            {
                                "code": "03.22.5",
                                "name": "Воспроизводство пресноводных биоресурсов искусственное"
                            },
                            {
                                "code": "03.22.6",
                                "name": "Акклиматизация пресноводных биоресурсов"
                            },
                            {
                                "code": "03.22.9",
                                "name": "Деятельность по пресноводному рыбоводству прочая"
                            }]
                        }]
                    }]
                }]
            },
            {
                "code": "Раздел B",
                "name": "Добыча полезных ископаемых",
                "items": [
                {
                    "code": "05",
                    "name": "Добыча угля",
                    "items": [
                    {
                        "code": "05.1",
                        "name": "Добыча и обогащение угля и антрацита",
                        "items": [
                        {
                            "code": "05.10",
                            "name": "Добыча и обогащение угля и антрацита",
                            "items": [
                            {
                                "code": "05.10.1",
                                "name": "Добыча угля и антрацита",
                                "items": [
                                {
                                    "code": "05.10.11",
                                    "name": "Добыча антрацита открытым способом"
                                },
                                {
                                    "code": "05.10.12",
                                    "name": "Добыча коксующегося угля открытым способом"
                                },
                                {
                                    "code": "05.10.13",
                                    "name": "Добыча угля, за исключением антрацита, угля коксующегося и угля бурого, открытым способом"
                                },
                                {
                                    "code": "05.10.14",
                                    "name": "Добыча антрацита подземным способом"
                                },
                                {
                                    "code": "05.10.15",
                                    "name": "Добыча коксующегося угля подземным способом"
                                },
                                {
                                    "code": "05.10.16",
                                    "name": "Добыча угля, за исключением антрацита, угля коксующегося и угля бурого, подземным способом"
                                }]
                            },
                            {
                                "code": "05.10.2",
                                "name": "Обогащение угля",
                                "items": [
                                {
                                    "code": "05.10.21",
                                    "name": "Обогащение антрацита"
                                },
                                {
                                    "code": "05.10.22",
                                    "name": "Обогащение коксующегося угля"
                                },
                                {
                                    "code": "05.10.23",
                                    "name": "Обогащение угля, кроме антрацита, угля коксующегося и угля бурого"
                                }]
                            }]
                        }]
                    },
                    {
                        "code": "05.2",
                        "name": "Добыча и обогащение бурого угля (лигнита)",
                        "items": [
                        {
                            "code": "05.20",
                            "name": "Добыча и обогащение бурого угля (лигнита)",
                            "items": [
                            {
                                "code": "05.20.1",
                                "name": "Добыча бурого угля (лигнита)",
                                "items": [
                                {
                                    "code": "05.20.11",
                                    "name": "Добыча бурого угля (лигнита) открытым способом"
                                },
                                {
                                    "code": "05.20.12",
                                    "name": "Добыча бурого угля (лигнита) подземным способом"
                                }]
                            },
                            {
                                "code": "05.20.2",
                                "name": "Обогащение бурого угля (лигнита)"
                            }]
                        }]
                    }]
                },
                {
                    "code": "06",
                    "name": "Добыча сырой нефти и природного газа",
                    "items": [
                    {
                        "code": "06.1",
                        "name": "Добыча сырой нефти и нефтяного (попутного) газа",
                        "items": [
                        {
                            "code": "06.10",
                            "name": "Добыча сырой нефти и нефтяного (попутного) газа",
                            "items": [
                            {
                                "code": "06.10.1",
                                "name": "Добыча сырой нефти"
                            },
                            {
                                "code": "06.10.2",
                                "name": "Добыча горючих (битуминозных) сланцев, песка и озокерита"
                            },
                            {
                                "code": "06.10.3",
                                "name": "Добыча нефтяного (попутного) газа"
                            },
                            {
                                "code": "06.10.4",
                                "name": "Разделение и извлечение нефтяного (попутного) газа"
                            }]
                        }]
                    },
                    {
                        "code": "06.2",
                        "name": "Добыча природного газа и газового конденсата",
                        "items": [
                        {
                            "code": "06.20",
                            "name": "Добыча природного газа и газового конденсата",
                            "items": [
                            {
                                "code": "06.20.1",
                                "name": "Добыча природного газа"
                            },
                            {
                                "code": "06.20.2",
                                "name": "Добыча газового конденсата"
                            }]
                        }]
                    }]
                },
                {
                    "code": "07",
                    "name": "Добыча металлических руд",
                    "items": [
                    {
                        "code": "07.1",
                        "name": "Добыча и обогащение железных руд",
                        "items": [
                        {
                            "code": "07.10",
                            "name": "Добыча и обогащение железных руд",
                            "items": [
                            {
                                "code": "07.10.1",
                                "name": "Добыча железных руд подземным способом"
                            },
                            {
                                "code": "07.10.2",
                                "name": "Добыча железных руд открытым способом"
                            },
                            {
                                "code": "07.10.3",
                                "name": "Обогащение и агломерация железных руд"
                            }]
                        }]
                    },
                    {
                        "code": "07.2",
                        "name": "Добыча руд цветных металлов",
                        "items": [
                        {
                            "code": "07.21",
                            "name": "Добыча урановой и ториевой руд",
                            "items": [
                            {
                                "code": "07.21.1",
                                "name": "Добыча и первичное обогащение урановых руд",
                                "items": [
                                {
                                    "code": "07.21.11",
                                    "name": "Добыча урановых руд подземным способом, включая способы подземного и кучного выщелачивания"
                                },
                                {
                                    "code": "07.21.12",
                                    "name": "Добыча урановых руд открытым способом, включая способ кучного выщелачивания"
                                }]
                            },
                            {
                                "code": "07.21.2",
                                "name": "Добыча и первичное обогащение ториевых руд"
                            }]
                        },
                        {
                            "code": "07.29",
                            "name": "Добыча руд прочих цветных металлов",
                            "items": [
                            {
                                "code": "07.29.1",
                                "name": "Добыча и обогащение медной руды"
                            },
                            {
                                "code": "07.29.2",
                                "name": "Добыча и обогащение никелевой и кобальтовой руд",
                                "items": [
                                {
                                    "code": "07.29.21",
                                    "name": "Добыча и обогащение никелевой руды"
                                },
                                {
                                    "code": "07.29.22",
                                    "name": "Добыча и обогащение кобальтовой руды"
                                }]
                            },
                            {
                                "code": "07.29.3",
                                "name": "Добыча и обогащение алюминийсодержащего сырья (бокситов и нефелин-апатитовых руд)",
                                "items": [
                                {
                                    "code": "07.29.31",
                                    "name": "Добыча алюминийсодержащего сырья подземным способом"
                                },
                                {
                                    "code": "07.29.32",
                                    "name": "Добыча алюминийсодержащего сырья открытым способом"
                                },
                                {
                                    "code": "07.29.33",
                                    "name": "Обогащение нефелин-апатитовых руд"
                                }]
                            },
                            {
                                "code": "07.29.4",
                                "name": "Добыча руд и песков драгоценных металлов и руд редких металлов",
                                "items": [
                                {
                                    "code": "07.29.41",
                                    "name": "Добыча руд и песков драгоценных металлов (золота, серебра и металлов платиновой группы)"
                                },
                                {
                                    "code": "07.29.42",
                                    "name": "Добыча и обогащение руд редких металлов (циркония, тантала, ниобия и т.п.)"
                                }]
                            },
                            {
                                "code": "07.29.5",
                                "name": "Добыча и обогащение свинцово-цинковой руды"
                            },
                            {
                                "code": "07.29.6",
                                "name": "Добыча и обогащение оловянной руды"
                            },
                            {
                                "code": "07.29.7",
                                "name": "Добыча и обогащение титаномагниевого сырья"
                            },
                            {
                                "code": "07.29.8",
                                "name": "Добыча и обогащение вольфраммолибденовой руды"
                            },
                            {
                                "code": "07.29.9",
                                "name": "Добыча и обогащение руд прочих цветных металлов",
                                "items": [
                                {
                                    "code": "07.29.91",
                                    "name": "Добыча и обогащение сурьмяно-ртутных руд"
                                },
                                {
                                    "code": "07.29.92",
                                    "name": "Добыча и обогащение марганцевых руд"
                                },
                                {
                                    "code": "07.29.93",
                                    "name": "Добыча и обогащение хромовых (хромитовых) руд"
                                },
                                {
                                    "code": "07.29.99",
                                    "name": "Добыча и обогащение руд прочих цветных металлов, не включенных в другие группировки"
                                }]
                            }]
                        }]
                    }]
                },
                {
                    "code": "08",
                    "name": "Добыча прочих полезных ископаемых",
                    "items": [
                    {
                        "code": "08.1",
                        "name": "Добыча камня, песка и глины",
                        "items": [
                        {
                            "code": "08.11",
                            "name": "Добыча декоративного и строительного камня, известняка, гипса, мела и сланцев",
                            "items": [
                            {
                                "code": "08.11.1",
                                "name": "Добыча и первичная обработка камня для памятников и строительства"
                            },
                            {
                                "code": "08.11.2",
                                "name": "Добыча и первичная обработка известняка и гипсового камня"
                            },
                            {
                                "code": "08.11.3",
                                "name": "Добыча мела и некальцинированного доломита"
                            },
                            {
                                "code": "08.11.4",
                                "name": "Добыча и первичная обработка сланцев"
                            }]
                        },
                        {
                            "code": "08.12",
                            "name": "Разработка гравийных и песчаных карьеров, добыча глины и каолина",
                            "items": [
                            {
                                "code": "08.12.1",
                                "name": "Разработка гравийных и песчаных карьеров"
                            },
                            {
                                "code": "08.12.2",
                                "name": "Добыча глины и каолина"
                            }]
                        }]
                    },
                    {
                        "code": "08.9",
                        "name": "Добыча полезных ископаемых, не включенных в другие группировки",
                        "items": [
                        {
                            "code": "08.91",
                            "name": "Добыча минерального сырья для химической промышленности и производства минеральных удобрений"
                        },
                        {
                            "code": "08.92",
                            "name": "Добыча и агломерация торфа",
                            "items": [
                            {
                                "code": "08.92.1",
                                "name": "Добыча торфа"
                            },
                            {
                                "code": "08.92.2",
                                "name": "Агломерация торфа"
                            }]
                        },
                        {
                            "code": "08.93",
                            "name": "Добыча соли"
                        },
                        {
                            "code": "08.99",
                            "name": "Добыча прочих полезных ископаемых, не включенных в другие группировки",
                            "items": [
                            {
                                "code": "08.99.1",
                                "name": "Добыча природного асфальта, асфальтитов и битумных пород"
                            },
                            {
                                "code": "08.99.2",
                                "name": "Добыча абразивных материалов, асбеста, кремнеземистой каменной муки, природных графитов, мыльного камня (талька), полевого шпата и т.д.",
                                "items": [
                                {
                                    "code": "08.99.21",
                                    "name": "Добыча природных абразивов, кроме алмазов"
                                },
                                {
                                    "code": "08.99.22",
                                    "name": "Добыча вермикулита"
                                },
                                {
                                    "code": "08.99.23",
                                    "name": "Добыча асбеста"
                                }]
                            },
                            {
                                "code": "08.99.3",
                                "name": "Добыча драгоценных камней, кварца, слюды, мусковита и т.д.",
                                "items": [
                                {
                                    "code": "08.99.31",
                                    "name": "Добыча драгоценных и полудрагоценных камней, кроме алмазов"
                                },
                                {
                                    "code": "08.99.32",
                                    "name": "Добыча алмазов"
                                },
                                {
                                    "code": "08.99.33",
                                    "name": "Добыча мусковита"
                                },
                                {
                                    "code": "08.99.34",
                                    "name": "Добыча пьезокварца"
                                },
                                {
                                    "code": "08.99.35",
                                    "name": "Добыча гранулированного кварца"
                                },
                                {
                                    "code": "08.99.36",
                                    "name": "Добыча слюды"
                                }]
                            }]
                        }]
                    }]
                },
                {
                    "code": "09",
                    "name": "Предоставление услуг в области добычи полезных ископаемых",
                    "items": [
                    {
                        "code": "09.1",
                        "name": "Предоставление услуг в области добычи нефти и природного газа",
                        "items": [
                        {
                            "code": "09.10",
                            "name": "Предоставление услуг в области добычи нефти и природного газа",
                            "items": [
                            {
                                "code": "09.10.1",
                                "name": "Предоставление услуг по бурению, связанному с добычей нефти, газа и газового конденсата"
                            },
                            {
                                "code": "09.10.2",
                                "name": "Предоставление услуг по монтажу, ремонту и демонтажу буровых вышек"
                            },
                            {
                                "code": "09.10.3",
                                "name": "Предоставление услуг по доразведке месторождений нефти и газа на особых экономических условиях (по соглашению о разделе продукции - СРП)"
                            },
                            {
                                "code": "09.10.4",
                                "name": "Сжижение и обогащение природного газа на месте добычи для последующей транспортировки"
                            },
                            {
                                "code": "09.10.9",
                                "name": "Предоставление прочих услуг в области добычи нефти и природного газа"
                            }]
                        }]
                    },
                    {
                        "code": "09.9",
                        "name": "Предоставление услуг в других областях добычи полезных ископаемых",
                        "items": [
                        {
                            "code": "09.90",
                            "name": "Предоставление услуг в других областях добычи полезных ископаемых"
                        }]
                    }]
                }]
            }]
            
            """;


    public static final String phoneNumber1 = "+79260011131";
    public static final String response1 = """
            {
                "phone_number": "+79260011131",
                "okved_code": "01.11.31",
                "okved_name": "Выращивание семян подсолнечника",
                "matching_length": 6
            }
            """;


    public static final String phoneNumber2 = "+79269980893";
    public static final String response2 = """
            {
                "phone_number": "+79269980893",
                "okved_code": "08.93",
                "okved_name": "Добыча соли",
                "matching_length": 4
            }
            """;

    public static final String phoneNumber3 = "+79269999909";
    public static final String response3 = """
            {
                "phone_number": "+79269999909",
                "okved_code": "09",
                "okved_name": "Предоставление услуг в области добычи полезных ископаемых",
                "matching_length": 2
            }
            """;
}
